Black8Mamba/IMXRT1052_for_fireboard/source/openblt/Target/Source/ARMCM7_NXP_IMX1052/flash.c
/************************************************************************************//**
* \file         Source/_template/flash.c
* \brief        Bootloader flash driver source file.
* \ingroup      Target__template_flash
* \internal
*----------------------------------------------------------------------------------------
*                          C O P Y R I G H T
*----------------------------------------------------------------------------------------
*   Copyright (c) 2019  by Feaser    http://www.feaser.com    All rights reserved
*
*----------------------------------------------------------------------------------------
*                            L I C E N S E
*----------------------------------------------------------------------------------------
* This file is part of OpenBLT. OpenBLT is free software: you can redistribute it and/or
* modify it under the terms of the GNU General Public License as published by the Free
* Software Foundation, either version 3 of the License, or (at your option) any later
* version.
*
* OpenBLT is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY;
* without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR
* PURPOSE. See the GNU General Public License for more details.
*
* You have received a copy of the GNU General Public License along with OpenBLT. It
* should be located in ".\Doc\license.html". If not, contact Feaser to obtain a copy.
*
* \endinternal
****************************************************************************************/

/************************************************************************************//**
* \defgroup   Target__template_flash Flash driver of a port
* \brief      This module implements the flash EEPROM memory driver of a microcontroller
*             port. 
* \details    The flash driver manages the actual erase and program operations on the
*             flash EEPROM and the signature checksum. 
*             The signature checksum is a 32-bit value in the user program. It is used as
*             a flag to determine if a user program is present or not.
*             Newly programmed data is always first buffered in RAM buffers with a size
*             of FLASH_WRITE_BLOCK_SIZE. 
*             This driver manages a second RAM buffer of the same size, called the 
*             bootBlock. The bootBlock buffers program data that includes the interrupt 
*             vector table and the 32-bit signature checksum. The signature checksum 
*             value is written as the last step during a firmware update, hence the need
*             for the bootBlock.
*             Note that the majority of this flash driver can be used as is. The only
*             parts that need to be updated / implemented are:
*             * Macros FLASH_WRITE_BLOCK_SIZE and BOOT_FLASH_VECTOR_TABLE_CS_OFFSET.
*             * The flashLayout[]-array contents.
*             * The functions FlashEraseSectors() and FlashWriteBlock().
*             * The functions FlashWriteChecksum() and FlashVerifyChecksum().
* \ingroup    Target__template
****************************************************************************************/

/****************************************************************************************
* Include files
****************************************************************************************/
#include "boot.h"                                /* bootloader generic header          */srec_cat bin转s19
#include "fsl_flexspi.h"
#include "bsp_norflash.h"
#include "perf_counter.h"
#define LOG_TAG    "flash"
#define LOG_LVL    ELOG_LVL_DEBUG
#include "elog.h"
#include "mbedtls/cipher.h"
#include "mbedtls/platform.h"

//arm-none-eabi-objcopy.exe -O ihex --gap-fill=0xFF MIMXRT1052_Project.axf output.hex
//arm-none-eabi-objcopy.exe -O binary --gap-fill=0xFF MIMXRT1052_Project.axf output.bin
//arm-none-eabi-objcopy.exe -O srec --gap-fill=0xFF MIMXRT1052_Project.axf output.srec
//arm-none-eabi-objcopy -I binary -O srec --change-addresses 0x60040000 MIMXRT1052_Project_Demo.bin MIMXRT1052_Project_Demo_new.s19

static uint32_t recv_size = 0;

/****************************************************************************************
* Macro definitions
****************************************************************************************/
/** \brief Value for an invalid sector entry index into flashLayout[]. */
#define FLASH_INVALID_SECTOR_IDX        (0xff)
/** \brief Value for an invalid flash address. */
#define FLASH_INVALID_ADDRESS           (0xffffffff)
/** \brief Standard size of a flash block for writing. */
/* TODO ##Port The FLASH_WRITE_BLOCK_SIZE should be at least 512. If for some reason this
 * is not large enough, double the size so: 512 -> 1024 -> 2048 -> 4096 etc.
 */
#define FLASH_WRITE_BLOCK_SIZE          (512)
/** \brief Total numbers of sectors in array flashLayout[]. */
#define FLASH_TOTAL_SECTORS             (sizeof(flashLayout)/sizeof(flashLayout[0]))
/** \brief End address of the bootloader programmable flash. */
#define FLASH_END_ADDRESS               (flashLayout[FLASH_TOTAL_SECTORS-1].sector_start + \
                                         flashLayout[FLASH_TOTAL_SECTORS-1].sector_size - 1)
/** \brief Offset into the user program's vector table where the checksum is located. 
 *         For this target it is set to the end of the vector table. Note that the 
 *         value can be overriden in blt_conf.h, because the size of the vector table
 *         could vary. When changing this value, don't forget to update the location
 *         of the checksum in the user program accordingly. Otherwise the checksum
 *         verification will always fail.
 */
#ifndef BOOT_FLASH_VECTOR_TABLE_CS_OFFSET
/* TODO ##Port The bootloader uses a 32-bit checksum signature value to determine if a 
 * a valid user program is present or not. This checksum value is written by the
 * bootloader at the end of a firmware update with function FlashWriteChecksum(). Right
 * before a user program is about to be started, function FlashVerifyChecksum() is called
 * to verify the presence of a user program. Space must be reserved in the user program
 * for the checksum signature value and the bootloader needs to know where this space
 * is reserved. It is recommended to place the signature checksum right after the 
 * user program's vector table. Using this approach it is easy to reserved space for the
 * checksum signature in the user program by simply adding one more dummy entry into the
 * vector table. This macro should be set to the size of the vector table, which can then
 * be used to determine the memory address of the signature checksum.
 */
#define BOOT_FLASH_VECTOR_TABLE_CS_OFFSET    (0x130)
#endif


/****************************************************************************************
* Plausibility checks
****************************************************************************************/
#if (BOOT_FLASH_VECTOR_TABLE_CS_OFFSET >= FLASH_WRITE_BLOCK_SIZE)
#error "BOOT_FLASH_VECTOR_TABLE_CS_OFFSET is set too high. It must be located in the first writable block."
#endif

#ifndef BOOT_FLASH_CUSTOM_LAYOUT_ENABLE
#define BOOT_FLASH_CUSTOM_LAYOUT_ENABLE (0u)
#endif

