Black8Mamba/IMXRT1052_for_fireboard/source/openblt/Target/Source/ARMCM7_NXP_IMX1052/flash.c
#if (BOOT_FLASH_CRYPTO_HOOKS_ENABLE > 0)
static uint8_t aes_256_key[] =
{
	0x51,0x7c,0x20,0xec,0x4f,0x7a,0xd4,0x13,
	0x78,0x86,0x25,0x31,0xee,0x16,0x7c,0x48,
	0x65,0x10,0x11,0x98,0x06,0xa0,0x16,0xd4,
	0x89,0xc9,0x2d,0x36,0x33,0x04,0x90,0xca
};

static uint8_t aes_256_iv[] =
{
    0x3d, 0xaf, 0xba, 0x42, 0x9d, 0x9e, 0xb4, 0x30,
    0xb4, 0x22, 0xda, 0x80, 0x2c, 0x9f, 0xac, 0x41
};
#endif

/****************************************************************************************
* Type definitions
****************************************************************************************/
/** \brief Flash sector descriptor type. */
typedef struct
{
  blt_addr   sector_start;                       /**< sector start address             */
  blt_int32u sector_size;                        /**< sector size in bytes             */
  blt_int8u  sector_num;                         /**< sector number                    */
} tFlashSector;

/** \brief    Structure type for grouping flash block information.
 *  \details  Programming is done per block of max FLASH_WRITE_BLOCK_SIZE. for this a
 *            flash block manager is implemented in this driver. this flash block manager
 *            depends on this flash block info structure. It holds the base address of
 *            the flash block and the data that should be programmed into the flash
 *            block. The .base_addr must be a multiple of FLASH_WRITE_BLOCK_SIZE.
 */
typedef struct
{
  blt_addr  base_addr;
  blt_int8u data[FLASH_WRITE_BLOCK_SIZE];
} tFlashBlockInfo;


/****************************************************************************************
* Hook functions
****************************************************************************************/
#if (BOOT_FLASH_CRYPTO_HOOKS_ENABLE > 0)
extern blt_bool FlashCryptoDecryptDataHook(blt_addr address, blt_int8u * data, 
                                           blt_int32u size);
#endif


/****************************************************************************************
* Function prototypes
****************************************************************************************/
static blt_bool  FlashInitBlock(tFlashBlockInfo *block, blt_addr address);
static tFlashBlockInfo *FlashSwitchBlock(tFlashBlockInfo *block, blt_addr base_addr);
static blt_bool  FlashAddToBlock(tFlashBlockInfo *block, blt_addr address,
                                 blt_int8u *data, blt_int32u len);
static blt_bool  FlashWriteBlock(tFlashBlockInfo *block);
static blt_bool  FlashEraseSectors(blt_int8u first_sector_idx, 
                                   blt_int8u last_sector_idx);
static blt_int8u FlashGetSectorIdx(blt_addr address);


/****************************************************************************************
* Local constant declarations
****************************************************************************************/
/** \brief   If desired, it is possible to set BOOT_FLASH_CUSTOM_LAYOUT_ENABLE to > 0
 *           in blt_conf.h and then implement your own version of the flashLayout[] table
 *           in a source-file with the name flash_layout.c. This way you customize the
 *           flash memory size reserved for the bootloader, without having to modify
 *           the flashLayout[] table in this file directly. This file will then include
 *           flash_layout.c so there is no need to compile it additionally with your
 *           project.
 */
#if (BOOT_FLASH_CUSTOM_LAYOUT_ENABLE == 0)
/** \brief   Array wit the layout of the flash memory.
 *  \details Also controls what part of the flash memory is reserved for the bootloader.
 *           If the bootloader size changes, the reserved sectors for the bootloader
 *           might need adjustment to make sure the bootloader doesn't get overwritten.
 */
static const tFlashSector flashLayout[] =
{
  /* TODO ##Port Update the contents of this array with the erase sector sizes as defined
   * in the microcontroller's reference manual. The flash sector erase sizes are
   * hardware specific and must therefore match, otherwise erase operations cannot be
   * performed properly. 
   * Besides controlling the flash erase size, this array also controls which sectors
   * are reserved for the bootloader and will therefore never be erased. The current
   * fictive implementation is for a microcontroller that can only erase flash memory
   * in chunks of 16 KB and the first 32 KB are reserved for the bootloader. Its flash
   * memory starts at 0x08000000 in the memory map.
   */
  { 0x60000000, 0x10000,  0},           /* flash sector  0 - reserved for bootloader   */
  { 0x60010000, 0x10000,  1},           /* flash sector  1 - reserved for bootloader   */
  { 0x60020000, 0x10000,  2},           /* flash sector  2 - reserved for bootloader   */
  { 0x60030000, 0x10000,  3},           /* flash sector  3 - reserved for bootloader   */
  { 0x60040000, 0x10000,  4},           /* flash sector  4 - 64kb                      */
  { 0x60050000, 0x10000,  5},           /* flash sector  5 - 64kb                      */
  { 0x60060000, 0x10000,  6},           /* flash sector  6 - 64kb                      */
  { 0x60070000, 0x10000,  7},           /* flash sector  7 - 64kb                      */
#if (BOOT_NVM_SIZE_KB > 256)
  { 0x60080000, 0x10000,  8},           /* flash sector  8 - 64kb                      */
  { 0x60090000, 0x10000,  9},           /* flash sector  9 - 64kb                      */
  { 0x600a0000, 0x10000,  10},          /* flash sector  10 - 64kb                      */
  { 0x600b0000, 0x10000,  11},          /* flash sector  11 - 64kb                      */
#endif
#if (BOOT_NVM_SIZE_KB > 512)
  { 0x600c0000, 0x10000,  12},          /* flash sector  12 - 64kb                      */
  { 0x600d0000, 0x10000,  13},          /* flash sector  13 - 64kb                      */
  { 0x600e0000, 0x10000,  14},          /* flash sector  14 - 64kb                      */
  { 0x600f0000, 0x10000,  15},          /* flash sector  15 - 64kb                      */
  { 0x60100000, 0x10000,  16},          /* flash sector  12 - 64kb                      */
  { 0x60110000, 0x10000,  17},          /* flash sector  13 - 64kb                      */
  { 0x60120000, 0x10000,  18},          /* flash sector  14 - 64kb                      */
  { 0x60130000, 0x10000,  19},          /* flash sector  15 - 64kb                      */
#endif
#if (BOOT_NVM_SIZE_KB > 1024)
#error "BOOT_NVM_SIZE_KB > 1024 is currently not supported."
#endif
};
#else
#include "flash_layout.c"
#endif /* BOOT_FLASH_CUSTOM_LAYOUT_ENABLE == 0 */


/****************************************************************************************
* Local data declarations
****************************************************************************************/
/** \brief   Local variable with information about the flash block that is currently
 *           being operated on.
 *  \details The smallest amount of flash that can be programmed is
 *           FLASH_WRITE_BLOCK_SIZE. A flash block manager is implemented in this driver
 *           and stores info in this variable. Whenever new data should be flashed, it
 *           is first added to a RAM buffer, which is part of this variable. Whenever
 *           the RAM buffer, which has the size of a flash block, is full or  data needs
 *           to be written to a different block, the contents of the RAM buffer are
 *           programmed to flash. The flash block manager requires some software
 *           overhead, yet results is faster flash programming because data is first
 *           harvested, ideally until there is enough to program an entire flash block,
 *           before the flash device is actually operated on.
 */
static tFlashBlockInfo blockInfo;

