Black8Mamba/IMXRT1052_for_fireboard/source/openblt/Target/Source/ARMCM7_NXP_IMX1052/flash.c
  /* first check that the bootblock contains valid data. if not, this means the
   * bootblock is not part of the reprogramming this time and therefore no
   * new checksum needs to be written
   */
  if (bootBlockInfo.base_addr != FLASH_INVALID_ADDRESS)
  {
#if (BOOT_FLASH_CRYPTO_HOOKS_ENABLE > 0)
    /* perform decryption of the bootblock, before calculating the checksum and writing it
     * to flash memory.
     */
    if (FlashCryptoDecryptDataHook(bootBlockInfo.base_addr, bootBlockInfo.data, 
                                   FLASH_WRITE_BLOCK_SIZE) == BLT_FALSE)
    {
      result = BLT_FALSE;
    }
#endif

    /* only continue if all is okay so far */
    if (result == BLT_TRUE)
    {
      /* compute the checksum. note that the user program's vectors are not yet written
       * to flash but are present in the bootblock data structure at this point.
       */
      signature_checksum += *((blt_int32u *)(&bootBlockInfo.data[0+0x00]));
      signature_checksum += *((blt_int32u *)(&bootBlockInfo.data[0+0x04]));
      signature_checksum += *((blt_int32u *)(&bootBlockInfo.data[0+0x08]));
      signature_checksum += *((blt_int32u *)(&bootBlockInfo.data[0+0x0C]));
      signature_checksum += *((blt_int32u *)(&bootBlockInfo.data[0+0x10]));
      signature_checksum += *((blt_int32u *)(&bootBlockInfo.data[0+0x14]));
      signature_checksum += *((blt_int32u *)(&bootBlockInfo.data[0+0x18]));
      signature_checksum  = ~signature_checksum; /* one's complement */
      signature_checksum += 1; /* two's complement */

      /* write the checksum */
      result = FlashWrite(flashLayout[0].sector_start+BOOT_FLASH_VECTOR_TABLE_CS_OFFSET,
                          sizeof(blt_addr), (blt_int8u *)&signature_checksum);
    }
  }
  
  /* give the result back to the caller */
  return result;
} /*** end of FlashWriteChecksum ***/


/************************************************************************************//**
** \brief     Verifies the checksum, which indicates that a valid user program is
**            present and can be started.
** \return    BLT_TRUE if successful, BLT_FALSE otherwise.
**
****************************************************************************************/
blt_bool FlashVerifyChecksum(void)
{
  blt_bool   result = BLT_TRUE;
  blt_int32u signature_checksum = 0;

  /* TODO ##Port Implement code here that basically does the reverse of
   * FlashWriteChecksum(). Just make sure to read the values directory from flash memory
   * and NOT from the bootBlock. 
   * The example implementation reads the first 7 32-bit from the user program flash
   * memory and sums them up. The signature checksum written by FlashWriteChecksum() was
   * the Two complement's value. This means that if you add the previously written
   * signature checksum value to the sum of the first 7 32-bit values, the result is
   * a value of 0 in case the signature checksum is valid.
   */

  /* verify the checksum based on how it was written by FlashWriteChecksum(). */
  signature_checksum += *((blt_int32u *)(flashLayout[0].sector_start));
  signature_checksum += *((blt_int32u *)(flashLayout[0].sector_start+0x04));
  signature_checksum += *((blt_int32u *)(flashLayout[0].sector_start+0x08));
  signature_checksum += *((blt_int32u *)(flashLayout[0].sector_start+0x0C));
  signature_checksum += *((blt_int32u *)(flashLayout[0].sector_start+0x10));
  signature_checksum += *((blt_int32u *)(flashLayout[0].sector_start+0x14));
  signature_checksum += *((blt_int32u *)(flashLayout[0].sector_start+0x18));
  /* add the checksum value that was written by FlashWriteChecksum(). Since this was a
   * Two complement's value, the resulting value should equal 0.
   */ 
  signature_checksum += *((blt_int32u *)(flashLayout[0].sector_start+BOOT_FLASH_VECTOR_TABLE_CS_OFFSET));
  /* sum should add up to an unsigned 32-bit value of 0 */
  if (signature_checksum != 0)
  {
    /* checksum not okay */
    result = BLT_FALSE;
  }
  
  /* give the result back to the caller */
  return result;
} /*** end of FlashVerifyChecksum ***/

static uint8_t prog_data[0x1000] = {0};

blt_bool firmware_dec(void)
{
	  uint8_t cipher_text[528] = {0};
	  uint32_t count = recv_size / 528;
	  uint32_t mod = recv_size % 528;
	  int erase_count = 0;
	  int j = 0;
	  for (int i = 0; i < count; ++i)
	  {
		memcpy(cipher_text, 0x60040000+i*528, 528);

		size_t len = 0;
		size_t dec_len = 0;

	    mbedtls_cipher_context_t ctx;
	    const mbedtls_cipher_info_t *info;

	    mbedtls_cipher_init(&ctx);
	    info = mbedtls_cipher_info_from_type(MBEDTLS_CIPHER_AES_256_CBC);
	    if (info == NULL)
	    {
	    	log_e("%s:%d mbedtls_cipher_info_from_type failed!\r\n", __func__, __LINE__);
	    	return BLT_FALSE;
	    }

	    if (mbedtls_cipher_setup(&ctx, info) != 0)
	    {
	    	return BLT_FALSE;
	    }

	    // 设置解密密钥
	    mbedtls_cipher_setkey(&ctx, aes_256_key, sizeof(aes_256_key)*8, MBEDTLS_DECRYPT);
	    mbedtls_cipher_set_iv(&ctx, aes_256_iv, sizeof(aes_256_iv));
	    mbedtls_cipher_set_padding_mode(&ctx, MBEDTLS_PADDING_PKCS7);

	    blt_int8u dec_data[FLASH_WRITE_BLOCK_SIZE] = {0};
	    if (mbedtls_cipher_update(&ctx, cipher_text, 528, dec_data, &len) != 0)
	    {
	        mbedtls_cipher_free(&ctx);
	        return BLT_FALSE;
	    }

	    dec_len += len;
	    len = 0;
	    mbedtls_cipher_free(&ctx);
	    memcpy(prog_data+j*512, dec_data, 512);
	    j++;
	    if (j == 8)
	    {
	    	j = 0;
	    }
	    memset(dec_data, 0, 512);
	    if ((i + 1) % 8 == 0 || ((i + 1) % 8 != 0 && (i+1) == count))
	    {
  		status_t status = FlexSPI_NorFlash_Erase_Sector(FLEXSPI, 0x40000+erase_count*0x1000);
  		if (status != kStatus_Success)
  		{
  			log_e("FlexSPI_NorFlash_Erase_Block failed!\r\n");
  			return BLT_FALSE;
  		}
  		status =  FlexSPI_NorFlash_Buffer_Program(FLEXSPI, 0x40000+erase_count*0x1000, prog_data, 0x1000);
  		if (status != kStatus_Success)
  		{
  			log_e("FlexSPI_NorFlash_Buffer_Program failed!\r\n");
  			return BLT_FALSE;
  		}
  		erase_count++;
  		memset(prog_data, 0, 0x1000);
	    }
	  }
}

/************************************************************************************//**
** \brief     Finalizes the flash driver operations. There could still be data in
**            the currently active block that needs to be flashed.
** \return    BLT_TRUE if successful, BLT_FALSE otherwise.
**
****************************************************************************************/
blt_bool FlashDone(void)
{
  blt_bool result = BLT_TRUE;

  log_i("FlashDone");

